#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>
//操作符

// 算术操作符
// + - * / %

//int main()
//{
//	int a = 7 % 2;
//	printf("%d\n", a);
//
//	return 0;
//}
//// % 两端必须是整数

//二进制
//原码
//补码
//反码
// 整型占4个字节
// -7
//10000000000000000000000000000111 -原码
//11111111111111111111111111111000 -反码
//11111111111111111111111111111001 -补码

//整数存补码
// 
//移位操作符 << >>只支持整数 

//int main()
//{
//	int a = 1000;
//	// << 左移
//	// *2的效果
//	// 移动二进制位
//	int b = a << 1;
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//
//	return 0;
//}
//  >>
//int main()
//{
//	int a = -7;
//	//右移 
//	int b = a >> 1;//不能移负数位
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//
//	return 0;
//}